{
  "magic": "E!vIA5L86J2I",
  "timestamp": "2024-07-07T00:46:04.531031+00:00",
  "repo": "lamps-wg/draft-composite-sigs",
  "labels": [
    {
      "name": "bug",
      "description": "Something isn't working",
      "color": "d73a4a"
    },
    {
      "name": "documentation",
      "description": "Improvements or additions to documentation",
      "color": "0075ca"
    },
    {
      "name": "duplicate",
      "description": "This issue or pull request already exists",
      "color": "cfd3d7"
    },
    {
      "name": "enhancement",
      "description": "New feature or request",
      "color": "a2eeef"
    },
    {
      "name": "good first issue",
      "description": "Good for newcomers",
      "color": "7057ff"
    },
    {
      "name": "help wanted",
      "description": "Extra attention is needed",
      "color": "008672"
    },
    {
      "name": "invalid",
      "description": "This doesn't seem right",
      "color": "e4e669"
    },
    {
      "name": "question",
      "description": "Further information is requested",
      "color": "d876e3"
    },
    {
      "name": "wontfix",
      "description": "This will not be worked on",
      "color": "ffffff"
    }
  ],
  "issues": [
    {
      "number": 1,
      "id": "I_kwDOL5eEDM6LI9I2",
      "title": "Carl Wallace's comments on composite signatures v13",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/issues/1",
      "state": "OPEN",
      "author": "johngray-dev",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "From:  https://github.com/EntrustCorporation/draft-ounsworth-composite-sigs/issues/147\r\n\r\nBelow are some comments, suggestions, and questions based on a brief review of draft-ounsworth-pq-composite-sigs-13.\r\n\r\nGeneral\r\n\r\nThe draft defines a set of 13 algorithms. Is LAMPS the right forum to vet algorithms? Generally, LAMPS deals with specs that describe how to use a given algorithm relative to PKIX and S/MIME artifacts, not algorithm specifications.\r\nIs the \"Internet PKI\" really the target? Is this kind of designation appropriate for what would appear to be a general-purpose algorithm specification?\r\nThe draft needs a thorough review to sharpen the fact that it now defines a set of 13 algorithms, not a framework for using composite key and signature combinations. Statements like \"should be regarded as a single key\" muddy the water. Even the term \"composite key\" is unhelpful. It's likely that most instances of the word \"composite\" could be written \"Composite ML-DSA.\" Given that this spec defines a means of generating and using keys and signatures, there's no need for all the \"drop-in replacement\" verbiage.\r\nOffhand, I think all of the relevant structures could use templates. Assuming this is correct, it may be worth including a section that notes ASN.1 decoders/encoders are not required.\r\nAll references to \"explicit composites\" should be reviewed and either deleted or amended.\r\nAbstract\r\n\r\nIs a \"X.509, PKIX, and CMS\" target appropriate for an algorithm specification? Is there some reason any of these 13 algorithms could not be used in a different context?\r\ns/Signaturem/Signature\r\nSections 2.3.1 - 2.3.3\r\n\r\nThese sections should include references to the relevant sections of each possible component algorithm. There is a list of algorithms in Section 5 (with a broken link for ML-DSA) but, given this is an algorithm specification, including more detail in the key generation, signature generation and signature verification sections would be appropriate and helpful.\r\ns/sketched/defined\r\nThere are two references to \"recursive composite public keys.\" These should be removed given they are not supported by definition.\r\nSection 2.3.1\r\n\r\ns/The KeyGen() -> (pk, sk) of a composite signature algorithm will perform the KeyGen() of the respective component signature algorithms / KeyGen() will perform the KeyGen() of the respective component signature algorithms\r\nIt's probably worth including pseudocode as done for Sign() and Verify()\r\nRewrite the last sentence to be Composite ML-DSA specific: The component keys MUST be uniquely generated for use in a Composite ML-DSA key.\r\nSection 2.3.2\r\n\r\nThe second and third steps could use some work. In step 2, S1 and S2 are raw signatures from a component algorithm. In step 3, they are BIT STRINGs containing the raw signatures. Additionally, it is unlikely the \"algorithm specifications\" address encoding as a BIT STRING. Suggest rewriting bullet 3 as below:\r\n\r\nEncode each component signature S1 and S2 as BIT STRINGs B1 and B2 then as a SEQUENCE\r\n\r\nsignature ::= Sequence { B1, B2 }\r\n\r\ns/A composite signature MUST produce/Sign() MUST produce\r\n\r\nSection 2.4\r\n\r\nDrop the word concatenation. No OIDs are being concatenated. There are other references to OID concatenation throughout the document that should be reviewed as well.\r\nSection 2.6\r\n\r\nDepending on the answer to the first question in General above, the following sentence may need to be removed or amended: \"If other combinations are needed, a separate specification should be submitted to the IETF LAMPS working group.\"\r\nThe statement that this \"also does not preclude future specification from extending these structures\" is false. The definitions are fixed at length 2. That someone could define a new specification with other lengths need not be commented on here. Suggest removing this sentence.\r\nSection 3\r\n\r\nReplace \"multiple algorithms\" with \"algorithm pairs\" or similar. Same comment applies throughout the draft.\r\nFWIW, I did not test compile the ASN.1 or work with the examples yet.\r\nGiven ECPoint is an alias for OCTET STRING do we need to ability to define types for each component, or can the object class be simplified to assert all component keys are simply OCTET STRINGs?\r\nSection 3.2\r\n\r\nThe reference to Table 3 is not altogether apt. The table lists signature algorithms. There should probably be a similar table for use in reconstituting SubjectPublicKeyInfo values (i.e., including curve name for parameters).\r\nSection 3.4\r\n\r\nWhy is this section necessary? The public key format defined by this specification is CompositeSignaturePublicKey. If someone wants to encode this in an OCTET STRING or BIT STRING that's their business.\r\nI would delete the entire section, but if the section remains, I would definitely delete the last sentence. The definitions provided call for DER encoding. Immediately following that with allowance for BER in the “interests of simplicity and avoiding compatibility issues” is odd in that it provides for neither. If you want to support BER and DER, cite BER encoding. But why do that? Amongst other things, that would break ability to templatize the artifacts.\r\nSection 5\r\n\r\nRemove \"for explicit combinations\" from the first sentence.\r\nRemove the second paragraph given the list is exhaustive for this specification.\r\nRemove the third paragraph since only 13 algorithms are defined. There is no flexibility provided for in this specification to define other combinations.\r\nSecurity Considerations\r\n\r\nThis section should incorporate security considerations from component algorithms by reference.\r\nThe section still reflects the earlier versions before the scope was limited to focus on 13 algorithms. It could use some pruning. Maybe move some of the stripping discussion to the signature generation section.\r\nAll considerations are listed under the same heading. These should be broken up into new subsections (or the heading removed).\r\nSection B.2\r\n\r\nThis section (and subsections) should probably be deleted. At a minimum, they aren't really \"Implementation considerations\" for the 13 algorithms that are the subject of the draft.",
      "createdAt": "2024-06-04T21:14:50Z",
      "updatedAt": "2024-06-05T14:41:06Z",
      "closedAt": null,
      "comments": [
        {
          "author": "johngray-dev",
          "authorAssociation": "COLLABORATOR",
          "body": "June 5th -  Lets all look at Carl's comments and discussion on June 19th.  ",
          "createdAt": "2024-06-05T14:41:05Z",
          "updatedAt": "2024-06-05T14:41:05Z"
        }
      ]
    },
    {
      "number": 2,
      "id": "I_kwDOL5eEDM6LI9xE",
      "title": "Address Kris comments about Section B.1 on FIPS #145",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/issues/2",
      "state": "CLOSED",
      "author": "johngray-dev",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "From:  https://github.com/EntrustCorporation/draft-ounsworth-composite-sigs/issues/145\r\n\r\nAddress Kris's comments:\r\n\r\nZjQcmQRYFpfptBannerEnd\r\nIn the section \"B.1 FIPS certification\", the draft says:\r\n\r\n\"algorithm to be [...] considered FIPS-approved even when one of the component algorithms is not\"\r\nand then\r\n\"overall composite should be considered full strength and thus FIPS-approved\"\r\nI think, the \"full strength\" may be misleading. Also the term is not clearly defined. Hence, it could be understood as \"full strength of classical+PQ\" and that is opposite to what NIST FAQ [1] says. I.e. let say MLDSA is FIPS-approved in a future, and we create composite with MLDSA-44 + some on-ramp signature that claims level 5. Does it mean the strength of that construct should be considered FIPS-approved with security strength of equal to level 2 or 5?\r\n\r\nAs this draft is now about creating composite signatures with MLDSA, so do we need B.1? The discussion about FIPS-approved dual signature schemes sounds like a great discussion to have, but in a different place (and ideally on CMUF forum).\r\n\r\nMy suggestion would be to remove B.1 to avoid spreading potentially misleading information about important topic.\r\n\r\nAdditional nit:\r\n\r\nThe abstract says \"Composite algorithms are provided which combine ML-DSA with RSA, ECDSA, Ed25519, and Ed448.\". Shouldn't it say MLDSA only?\r\n--\r\nKris Kwiatkowski\r\nCryptography Dev\r\n\r\n\r\n--- Group discussed this and decide to change the following:\r\n\r\nchange:\r\noverall composite should be considered full strength and thus FIPS-approved\"\r\nto\r\noverall composite should be considered at least as strong and thus FIPS-approved\"\r\n\r\nuntil FIPS deprecates RSA or EC...",
      "createdAt": "2024-06-04T21:16:55Z",
      "updatedAt": "2024-06-06T16:07:03Z",
      "closedAt": "2024-06-06T16:07:03Z",
      "comments": [
        {
          "author": "johngray-dev",
          "authorAssociation": "COLLABORATOR",
          "body": "The comment was addressed and the issue has been resolved is -01 version",
          "createdAt": "2024-06-06T16:07:03Z",
          "updatedAt": "2024-06-06T16:07:03Z"
        }
      ]
    },
    {
      "number": 3,
      "id": "I_kwDOL5eEDM6LI-F0",
      "title": "Unreferenced section \"Parallel PKIs\"",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/issues/3",
      "state": "CLOSED",
      "author": "johngray-dev",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "From:  https://github.com/EntrustCorporation/draft-ounsworth-composite-sigs/issues/143\r\n\r\nThe section [\"Parallel PKIs\"](https://github.com/EntrustCorporation/draft-ounsworth-composite-sigs/blob/final13copies/draft-ounsworth-pq-composite-sigs.md#parallel-pkis) in \"Implementation Considerations\" introduces a term that is not used throughout the document and therefore should be removed.\r\n\r\nTeam decided to remove the section on Parallel PKI's",
      "createdAt": "2024-06-04T21:17:56Z",
      "updatedAt": "2024-06-06T16:06:02Z",
      "closedAt": "2024-06-06T16:06:01Z",
      "comments": [
        {
          "author": "johngray-dev",
          "authorAssociation": "COLLABORATOR",
          "body": "This issue was resolve in version -01",
          "createdAt": "2024-06-06T16:06:01Z",
          "updatedAt": "2024-06-06T16:06:01Z"
        }
      ]
    },
    {
      "number": 4,
      "id": "I_kwDOL5eEDM6LI-ad",
      "title": "Add a \"SignedInfo Conventions\" section",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/issues/4",
      "state": "CLOSED",
      "author": "johngray-dev",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "From:   https://github.com/EntrustCorporation/draft-ounsworth-composite-sigs/issues/136\r\n\r\nMake-like-picture from\r\nhttps://datatracker.ietf.org/doc/html/draft-ietf-lamps-cms-sphincs-plus-03#name-signed-data-conventions\r\n\r\nWe also need to add SMIME-CAPS to the ASN.1. See the draft-cms-sphincs-plus\r\n\r\nDoing this saves writing a separate draft of using this draft in CMS... Use link from Mike above SPHINCS template.",
      "createdAt": "2024-06-04T21:19:04Z",
      "updatedAt": "2024-06-19T20:39:11Z",
      "closedAt": "2024-06-19T20:39:11Z",
      "comments": [
        {
          "author": "johngray-dev",
          "authorAssociation": "COLLABORATOR",
          "body": "Action:  John to take a look at this (from what Mike did in Composite KEM), with the idea that maybe lamps will want us to put it in a separate document.   To present this section next meeting (June 19th).",
          "createdAt": "2024-06-05T14:40:05Z",
          "updatedAt": "2024-06-05T14:40:05Z"
        },
        {
          "author": "johngray-dev",
          "authorAssociation": "COLLABORATOR",
          "body": "Issue resolved in Pull request #13 ",
          "createdAt": "2024-06-19T20:39:11Z",
          "updatedAt": "2024-06-19T20:39:11Z"
        }
      ]
    },
    {
      "number": 5,
      "id": "I_kwDOL5eEDM6LI_C2",
      "title": "Resolve OID registration - Entrust assignment or IANA assignment",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/issues/5",
      "state": "OPEN",
      "author": "johngray-dev",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "From:  https://github.com/EntrustCorporation/draft-ounsworth-composite-sigs/issues/126\r\n\r\nRuss suggested Entrust could just assign the OIDs for composite sigs since we maintain an OID repository. Discuss this with the authors group and add to the next version -13?\r\n\r\nFrom Russ: \": If you are going to use the Entrust OID arc for the module assignment, why not assign it now.\"\r\n\r\nFor example, the module assignment could be:\r\nComposite-Signatures-2023\r\n{ joint-iso-itu-t(2) country(16) us(840) organization(1) entrust(114027)\r\nalgorithm(80) composite(8) id-composite-signatures-2023 (1) }\r\n\r\nToday we have:\r\nComposite-Signatures-2023\r\n{ joint-iso-itu-t(2) country(16) us(840) organization(1) entrust(114027)\r\nalgorithm(80) id-composite-signatures-2023 (TBDMOD) }\r\n\r\nAnd in Composite KEM we are using (for comparison):\r\n\r\nComposite-KEM-2023\r\n{iso(1) identified-organization(3) dod(6) internet(1)\r\nsecurity(5) mechanisms(5) pkix(7) id-mod(0)\r\nid-mod-composite-kems(TBDMOD) }\r\n\r\n\r\nMike and I discussed, we think having IANA assignment would make it more official and not look like it is only for Entrust.   The group decided that IANA assignment is the way to go, this will align with Composite KEM as well\r\n\r\n",
      "createdAt": "2024-06-04T21:21:15Z",
      "updatedAt": "2024-06-04T21:21:15Z",
      "closedAt": null,
      "comments": []
    },
    {
      "number": 6,
      "id": "I_kwDOL5eEDM6LI_pD",
      "title": "Should we consider compacting the CompositeSignaturePrivateKey Format like we did with the public key format?",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/issues/6",
      "state": "OPEN",
      "author": "johngray-dev",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "From:  https://github.com/EntrustCorporation/draft-ounsworth-composite-sigs/issues/121\r\n\r\nWe simplified the composite signature public key format from:\r\n\r\nCompositeSignaturePublicKey ::= SEQUENCE SIZE (2..MAX) OF SubjectPublicKeyInfo\r\nto\r\nCompositeSignaturePublicKey ::= SEQUENCE SIZE (2) OF BIT STRING\r\n\r\nWe haven't changed the CompositePrivateKeyFormat:\r\nCompositeSignaturePrivateKey ::= SEQUENCE SIZE (2) OF OneAsymmetricKey\r\n\r\nOneAsymmetric Key from RFC 5958 is this:\r\n\r\nOneAsymmetricKey ::= SEQUENCE {\r\nversion Version,\r\nprivateKeyAlgorithm PrivateKeyAlgorithmIdentifier,\r\nprivateKey PrivateKey,\r\nattributes [0] Attributes OPTIONAL,\r\n...,\r\n[[2: publicKey [1] PublicKey OPTIONAL ]],\r\n...\r\n}\r\n\r\nPrivateKey ::= OCTET STRING\r\n-- Content varies based on type of key. The\r\n-- algorithm identifier dictates the format of\r\n-- the key.\r\n\r\nOneAsymmetricKey can carry the public key and has the algorithmIdentifier and version fields which are really redundant information. I think we could simply do this:\r\n\r\nCompositeSignaturePrivateKey ::= SEQUENCE SIZE (2) OF PrivateKey\r\n\r\nwhich is effectively:\r\nCompositeSignaturePrivateKey ::= SEQUENCE SIZE (2) OF OCTET STRING\r\n\r\nIt would allow sending composite private keys in PKCS12, or in raw encrypted blobs, to be smaller.\r\n\r\n\r\nAs of May 8th, 2024 - We are leaning in making this compact change - after getting the v14 update published on the lamp-wg github.\r\n\r\nIt also has the benefit of making key consistency better defined as a static mapping of the algorithm details needs to be used to reonstruct the private key.",
      "createdAt": "2024-06-04T21:23:19Z",
      "updatedAt": "2024-06-05T14:32:54Z",
      "closedAt": null,
      "comments": [
        {
          "author": "johngray-dev",
          "authorAssociation": "COLLABORATOR",
          "body": "June 5th - We will keep this one here, revisit after the final standards are released.",
          "createdAt": "2024-06-05T14:32:52Z",
          "updatedAt": "2024-06-05T14:32:52Z"
        }
      ]
    },
    {
      "number": 7,
      "id": "I_kwDOL5eEDM6LJAQa",
      "title": "Add a new section: explicitely list SPKI AlgIds",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/issues/7",
      "state": "OPEN",
      "author": "johngray-dev",
      "authorAssociation": "COLLABORATOR",
      "assignees": [
        "janklaussner"
      ],
      "labels": [],
      "body": "From:  https://github.com/EntrustCorporation/draft-ounsworth-composite-sigs/issues/116\r\n\r\nWe should add a section listing explicitly the DER-encoded AlgorithmIdentifiers for the components of each composite public key and signature algorithm. This is important to resolve ambiguity on, for example, whether the RSA should have a NULL param, and the ECC curve params.\r\n\r\nExample, for id-MLDSA44-ECDSA-P256-SHA256 the ML-DSA SPKI would have an AlgorithmIdentifier of:\r\n\r\n   AlgorithmIdentifier  ::=  SEQUENCE  {\r\n        id-ml-dsa\r\n    }\r\nwhich is:\r\n\r\nAlgorithmIdentifier  ::=  SEQUENCE  {\r\n        {\r\n     1.3.6.1.4.1.2.267.12.4.4\r\n      }\r\n  }\r\nAnd the ECDSA-P256-SHA256 would have a SPKI would have an AlgorithmIdentifier of:\r\n\r\n   AlgorithmIdentifier  ::=  SEQUENCE  {\r\n        id-ecPublicKey,\r\n       secp256r1  \r\n  }\r\nwhich is:\r\n\r\n   AlgorithmIdentifier  ::=  SEQUENCE  {\r\n        {\r\n     iso(1) member-body(2) us(840) ansi-X9-62(10045) keyType(2) 1 },\r\n       iso(1) member-body(2) us(840) ansi-X9-62(10045) curves(3) prime(1) 7}\r\nAnd the signature algorithm for id-MLDSA44-ECDSA-P256-SHA256, the first component signature algorithm would have an AlgorithmIdentifier of\r\n\r\n   AlgorithmIdentifier  ::=  SEQUENCE  {\r\n        id-ml-dsa\r\n    }\r\nwhich is:\r\n\r\nAlgorithmIdentifier  ::=  SEQUENCE  {\r\n        {\r\n     1.3.6.1.4.1.2.267.12.4.4\r\n      }\r\n  }\r\nand the second component signature algorithm would have an AlgorithmIdentifier of\r\n\r\n   AlgorithmIdentifier  ::=  SEQUENCE  {\r\n          ecdsa-with-SHA256\r\n  }\r\nwhich is:\r\n\r\nAlgorithmIdentifier  ::=  SEQUENCE  {\r\n           {\r\n     iso(1) member-body(2) us(840) ansi-X9-62(10045) signatures(4) ecdsa-with-SHA2(3) 2\r\n       }\r\n  }\r\nWith that done, we should replace the message prefix values in Sectien 2.4 with the SHA256 hash of the signature AlgorithmIdentifiers. This has two nice properties that are better than using the ASCII encoding of the OID name: 1) they are all the same length (ie the length of SHA256), and 2) if the inner OIDs change, for example with a new Kyber version, then the message prefix changes, which prevents cryptographic compatibility issues; or otherwise stated: provides signature domain-separation based on the component OIDs.\r\n\r\n--- SHA256 of the DER encoding of the following ASN.1 value\r\n--- Security Consideration note: the choice of SHA256 here is not security-relevant since it is only to generate fixed string values.\r\n\r\nSEQUENCE {\r\nAlgorithmIdentifier  ::=  SEQUENCE  {\r\n        {\r\n     1.3.6.1.4.1.2.267.12.4.4\r\n      }\r\n  },\r\nAlgorithmIdentifier  ::=  SEQUENCE  {\r\n           {\r\n     iso(1) member-body(2) us(840) ansi-X9-62(10045) signatures(4) ecdsa-with-SHA2(3) 2\r\n       }\r\n  }\r\n}",
      "createdAt": "2024-06-04T21:24:28Z",
      "updatedAt": "2024-07-03T14:59:54Z",
      "closedAt": null,
      "comments": [
        {
          "author": "johngray-dev",
          "authorAssociation": "COLLABORATOR",
          "body": "June 5th - Group would like to make the draft more clear in this regard, but not explode the draft.  Suggestion of a table or template section for RSA to make things more clear.    Action:  Jan to take a look at this for the next meeting (June 19th, 2024).",
          "createdAt": "2024-06-05T14:37:29Z",
          "updatedAt": "2024-06-05T14:37:29Z"
        },
        {
          "author": "janklaussner",
          "authorAssociation": "COLLABORATOR",
          "body": "Hi @johngray-dev,  @ounsworth ,\r\nI tried to write these things together (https://github.com/lamps-wg/draft-composite-sigs/blob/7-add-a-new-section-explicitely-list-spki-algids/draft-ietf-lamps-pq-composite-sigs.md) and have a question: \r\n\r\nThe algorithm for compiling the component OIDs to the hash value is easy but nevertheless an algorithm with the possibility for errors.\r\nIf we want domain separation that way we definitely need to include the EC parameter OID in the algorithm, else NIST and brainpool curves would have the same hash. Additionally we should have a rational why we do not include the PreHash OID here. Or include this also.\r\n\r\nThis said, this whole thing only makes sense during the development phase, because we dont know the MLDSA OIDs yet. But once they are fixed, also our combination matrix is fixed with new and official CompSig OIDs. So just Hashing the CompSig OID would do the same job and is much easier to describe in the signature algorithm.\r\nI am afraid reviewers would reject the compilation algorithm for the same reason.\r\n\r\nSo the question is, do we want to go the whole way of flexibility and define the compilation algorithm (that I would gladly do and maybe reuse for the kofn algorithm) or do we go the shortcut.\r\n\r\nWhat do you think? Do I miss something here?",
          "createdAt": "2024-06-28T15:48:25Z",
          "updatedAt": "2024-06-28T15:48:25Z"
        }
      ]
    },
    {
      "number": 9,
      "id": "I_kwDOL5eEDM6LZ3vD",
      "title": "ML-DSA public keys should be unwrapped BIT STRINGS with no ASN.1 typing",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/issues/9",
      "state": "OPEN",
      "author": "ounsworth",
      "authorAssociation": "CONTRIBUTOR",
      "assignees": [],
      "labels": [],
      "body": "See on-list discussion: https://mailarchive.ietf.org/arch/msg/spasm/oH68LMpwXtpvltK2PnQSCUO9s0k/\r\n\r\nI see that draft-ietf-lamps-dilithium-certificates-03 does this:\r\n\r\n~~~\r\n  pk-MLDSA PUBLIC-KEY ::= {\r\n    IDENTIFIER id-MLDSA\r\n    -- KEY no ASN.1 wrapping --\r\n    PARAMS ARE absent\r\n    CERT-KEY-USAGE { nonRepudiation, digitalSignature,\r\n                    keyCertSign, cRLSign }\r\n    --- PRIVATE-KEY no ASN.1 wrapping --\r\n  }\r\n~~~\r\n",
      "createdAt": "2024-06-06T17:32:33Z",
      "updatedAt": "2024-07-03T15:00:15Z",
      "closedAt": null,
      "comments": [
        {
          "author": "ounsworth",
          "authorAssociation": "CONTRIBUTOR",
          "body": "Carl suggested:\r\n\r\n~~~\r\nOr this (also not yet test compiled) definition:\r\n\r\n     id-raw-key ::= SOME OBJECT IDENTIFIER\r\n   pk-CompositeSignature {OBJECT IDENTIFIER:id,\r\n     FirstPublicKeyType,SecondPublicKeyType }\r\n       PUBLIC-KEY ::= {\r\n         IDENTIFIER id\r\n         KEY SEQUENCE {\r\n           firstPublicKey BIT STRING (CONTAINING FirstPublicKeyType  | ENCODED BY id-raw-key),\r\n           secondPublicKey BIT STRING (CONTAINING SecondPublicKeyType | ENCODED BY id-raw-key)\r\n         }\r\n         PARAMS ARE absent\r\n         CERT-KEY-USAGE { digitalSignature, nonRepudiation, keyCertSign, cRLSign}\r\n       }\r\n\r\n~~~",
          "createdAt": "2024-06-06T18:31:18Z",
          "updatedAt": "2024-06-06T18:31:18Z"
        },
        {
          "author": "ounsworth",
          "authorAssociation": "CONTRIBUTOR",
          "body": "Russ suggested:\r\n\r\n~~~\r\npk-MLDSA87-ECDSA-P384-SHA512 PUBLIC-KEY ::= {\r\n  IDENTIFIER id-MLDSA87-ECDSA-P384-SHA512\r\n  KEY SEQUENCE {key1 BIT STRING, key2 ECPoint}\r\n  PARAMS ARE absent\r\n  CERT-KEY-USAGE { digitalSignature, nonRepudiation, keyCertSign, cRLSign} )\r\n~~~\r\n\r\nwith some text to explain that BIT STRING is unwrapped / raw.",
          "createdAt": "2024-06-06T21:12:51Z",
          "updatedAt": "2024-06-06T21:12:51Z"
        },
        {
          "author": "ounsworth",
          "authorAssociation": "CONTRIBUTOR",
          "body": "Duplicate of #11 ?",
          "createdAt": "2024-07-03T15:00:14Z",
          "updatedAt": "2024-07-03T15:00:14Z"
        }
      ]
    },
    {
      "number": 10,
      "id": "I_kwDOL5eEDM6LZ38A",
      "title": "ASN.1 module still contains FN-DSA definitions",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/issues/10",
      "state": "CLOSED",
      "author": "ounsworth",
      "authorAssociation": "CONTRIBUTOR",
      "assignees": [],
      "labels": [],
      "body": "Remove them.",
      "createdAt": "2024-06-06T17:32:57Z",
      "updatedAt": "2024-06-18T15:13:04Z",
      "closedAt": "2024-06-18T15:13:03Z",
      "comments": [
        {
          "author": "johngray-dev",
          "authorAssociation": "COLLABORATOR",
          "body": "Removed the \"Falon\" definition (which was a typo and why I missed it in the first place).   See:  https://github.com/lamps-wg/draft-composite-sigs/commit/d3e2c8e1296bf6d9d634ab7d0e9c7629e243aac0\r\n\r\n\r\n",
          "createdAt": "2024-06-18T15:13:03Z",
          "updatedAt": "2024-06-18T15:13:03Z"
        }
      ]
    },
    {
      "number": 11,
      "id": "I_kwDOL5eEDM6LZ42X",
      "title": "Should the pk-CompositeSignature ASN.1 constructor be unrolled for each type?",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/issues/11",
      "state": "OPEN",
      "author": "ounsworth",
      "authorAssociation": "CONTRIBUTOR",
      "assignees": [],
      "labels": [],
      "body": "We defined the pk-CompositeSignature information object class so that the rest of the ASN.1 module could be more compact, but it might be limiting optimization since this draft is now ML-DSA only. Perhaps we should remove this and and just directly define the PUBLIC-KEY structure for each public key type?\r\n\r\nSee, for example, the definition from draft-ietf-lamps-dilithium-certificates-03\r\n\r\n~~~\r\n  pk-MLDSA PUBLIC-KEY ::= {\r\n    IDENTIFIER id-MLDSA\r\n    -- KEY no ASN.1 wrapping --\r\n    PARAMS ARE absent\r\n    CERT-KEY-USAGE { nonRepudiation, digitalSignature,\r\n                    keyCertSign, cRLSign }\r\n    --- PRIVATE-KEY no ASN.1 wrapping --\r\n  }\r\n~~~",
      "createdAt": "2024-06-06T17:35:24Z",
      "updatedAt": "2024-07-03T14:51:12Z",
      "closedAt": null,
      "comments": [
        {
          "author": "johngray-dev",
          "authorAssociation": "COLLABORATOR",
          "body": "Group decided to look at this in more detail post IETF 120.",
          "createdAt": "2024-07-03T14:48:21Z",
          "updatedAt": "2024-07-03T14:48:21Z"
        },
        {
          "author": "ounsworth",
          "authorAssociation": "CONTRIBUTOR",
          "body": "The optimization that I would like us to take advantage of is to more closely match the public key encoding from \r\n\r\nhttps://datatracker.ietf.org/doc/html/draft-ietf-lamps-dilithium-certificates-03#name-asn1-module\r\n\r\nWe should check the DER encoding of the Dilithium public key within a composite public key against the sample in the dilithium-certs draft. The question is whether the composite is adding an extra OCTET STRING tag which is not strictly necessary.",
          "createdAt": "2024-07-03T14:51:10Z",
          "updatedAt": "2024-07-03T14:51:10Z"
        }
      ]
    },
    {
      "number": 14,
      "id": "I_kwDOL5eEDM6M6Mps",
      "title": "SHA256withECDSA vs ECDSAwithSHA256",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/issues/14",
      "state": "OPEN",
      "author": "danvangeest",
      "authorAssociation": "NONE",
      "assignees": [
        "janklaussner"
      ],
      "labels": [],
      "body": "I'm curious why in the \"Composite Signature Algorithms\" table, SHA256withECDSA for example is used instead of ECDSAwithSHA256? Isn't the latter more commonly used terminology?",
      "createdAt": "2024-06-20T10:13:31Z",
      "updatedAt": "2024-07-05T21:03:18Z",
      "closedAt": null,
      "comments": [
        {
          "author": "johngray-dev",
          "authorAssociation": "COLLABORATOR",
          "body": "In July 3rd, Jan said he would update the table.  ",
          "createdAt": "2024-07-03T14:41:47Z",
          "updatedAt": "2024-07-03T14:41:47Z"
        },
        {
          "author": "janklaussner",
          "authorAssociation": "COLLABORATOR",
          "body": "updated the naming in the table in PR#16",
          "createdAt": "2024-07-05T21:03:17Z",
          "updatedAt": "2024-07-05T21:03:17Z"
        }
      ]
    },
    {
      "number": 15,
      "id": "I_kwDOL5eEDM6N66ds",
      "title": "PSS parameter spec tables should include the SALT length",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/issues/15",
      "state": "CLOSED",
      "author": "johngray-dev",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "The suggested PSS parameter tables for id-MLDSA44-RSA2048-PSS-SHA256 and id-MLDSA65-RSA3072-PSS-SHA512 don't give any indication of the salt length to use.   \r\n\r\nIn my implementation we used 64-bytes for both, but RFC's 4055 and 8017 suggest the typical salt length as one that matches the hashing length.  This would indicate a \"typical\" salt length of 32 for id-MLDSA44-RSA2048-PSS-SHA256 and 64 id-MLDSA65-RSA3072-PSS-SHA512\r\n\r\nRFC 8017 section 9.1 says this:\r\n\r\nTypical salt lengths in octets are hLen (the length of the output\r\n       of the hash function Hash) and 0.  In both cases, the security of\r\n       RSASSA-PSS can be closely related to the hardness of inverting\r\n       RSAVP1. \r\n\r\nFrom Tim Holobeek:\r\n\r\nHello,\r\n\r\nOur engineering team has been looking at composite signatures, and found a potential ambiguity.  The draft uses OIDs for everything, with no parameters (good), but this begs the question of what the right parameters are for rsa-pss, in particular the salt length, which isn’t included in the parameters table.\r\n\r\nThere’s also the question of what the right answer is, which honestly I haven’t had time to review.  They’re saying that RFC 4055 suggests matching the length of the hash in its security considerations section, which sounds reasonable, but Openssl seems to be hard-coded to always use 64 bytes of salt.  Which sounds right to me for SHA512 but not necessarily SHA256.",
      "createdAt": "2024-06-28T19:17:03Z",
      "updatedAt": "2024-07-03T20:45:54Z",
      "closedAt": "2024-07-03T20:45:53Z",
      "comments": [
        {
          "author": "johngray-dev",
          "authorAssociation": "COLLABORATOR",
          "body": "Thanks for the comments.   We added PSS salt parameters.   We used 256 bits for id-MLDSA44-RSA2048-PSS-SHA256 and 512 bits for  id-MLDSA65-RSA3072-PSS-SHA512\r\n\r\nhttps://github.com/lamps-wg/draft-composite-sigs/commit/5753715bfe3cf35b5f797b14d8584041459a3266",
          "createdAt": "2024-07-03T20:45:53Z",
          "updatedAt": "2024-07-03T20:45:53Z"
        }
      ]
    }
  ],
  "pulls": [
    {
      "number": 8,
      "id": "PR_kwDOL5eEDM5xs5E5",
      "title": "Update tov13",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/pull/8",
      "state": "MERGED",
      "author": "johngray-dev",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "- Added back the v13 changes\r\n- Fixed issues #2 and #3\r\n- Added changes since adoption section\r\n- Added Scott Fluher as an auther",
      "createdAt": "2024-06-06T16:03:49Z",
      "updatedAt": "2024-06-20T03:19:17Z",
      "baseRepository": "lamps-wg/draft-composite-sigs",
      "baseRefName": "main",
      "baseRefOid": "de8244a96beb9000d84c6979a2fcc913c4d32719",
      "headRepository": "lamps-wg/draft-composite-sigs",
      "headRefName": "UpdateTov13",
      "headRefOid": "ad27c830706d2d34ba4a92cefca15b440adda3f5",
      "closedAt": "2024-06-06T16:05:02Z",
      "mergedAt": "2024-06-06T16:05:02Z",
      "mergedBy": "johngray-dev",
      "mergeCommit": {
        "oid": "b7f6a91cd28f8324904466b4e2911495ace19023"
      },
      "comments": [],
      "reviews": []
    },
    {
      "number": 12,
      "id": "PR_kwDOL5eEDM5x9jYU",
      "title": "Fix typos",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/pull/12",
      "state": "CLOSED",
      "author": "jiep",
      "authorAssociation": "NONE",
      "assignees": [],
      "labels": [],
      "body": "",
      "createdAt": "2024-06-10T11:09:06Z",
      "updatedAt": "2024-07-03T20:50:35Z",
      "baseRepository": "lamps-wg/draft-composite-sigs",
      "baseRefName": "main",
      "baseRefOid": "b7f6a91cd28f8324904466b4e2911495ace19023",
      "headRepository": "jiep/draft-composite-sigs",
      "headRefName": "patch-1",
      "headRefOid": "43070ba61ceae7b528446d32a5113785157b696a",
      "closedAt": "2024-07-03T20:50:03Z",
      "mergedAt": null,
      "mergedBy": null,
      "mergeCommit": null,
      "comments": [
        {
          "author": "johngray-dev",
          "authorAssociation": "COLLABORATOR",
          "body": "We merged your comments separately.   We changed the n to 2 as you suggested, we reworded the about the y bitstrength, and we looked up what NIST used in their documents and they used ML-DSA-44 (for example), so we will continue to use that one.    Thank you so much for your comments and suggestions.  We also added you to the acknowledgement section at the end of the document.  ",
          "createdAt": "2024-07-03T20:49:46Z",
          "updatedAt": "2024-07-03T20:49:46Z"
        },
        {
          "author": "johngray-dev",
          "authorAssociation": "COLLABORATOR",
          "body": "As mentioned above, we manually merged your comments and made some suggested wording changes.  ",
          "createdAt": "2024-07-03T20:50:34Z",
          "updatedAt": "2024-07-03T20:50:34Z"
        }
      ],
      "reviews": []
    },
    {
      "number": 13,
      "id": "PR_kwDOL5eEDM5zAHxz",
      "title": "4 signed info use in cms",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/pull/13",
      "state": "MERGED",
      "author": "johngray-dev",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "Merge the changes for #4 into the main branch.   Reviewed and edits by the authors group.\r\n\r\nAdded a \"Use in CMS\" section\r\nRemoved a Falon reference from the ASN.1 document (which was a typo in reference to Falcon)\r\nAdded SMIME-CAPS into the sa-CompositeSignature definition in the ASN.1 module\r\nFixed nits and other typos",
      "createdAt": "2024-06-19T20:36:44Z",
      "updatedAt": "2024-06-20T03:19:09Z",
      "baseRepository": "lamps-wg/draft-composite-sigs",
      "baseRefName": "main",
      "baseRefOid": "d59d73da181cf23f8ecce17f7daf8c5a0e310fc3",
      "headRepository": "lamps-wg/draft-composite-sigs",
      "headRefName": "4-signedInfo-UseInCMS",
      "headRefOid": "b4cf50eafb96d85c0d49cc067c3507bfad5b68f6",
      "closedAt": "2024-06-19T20:38:30Z",
      "mergedAt": "2024-06-19T20:38:30Z",
      "mergedBy": "johngray-dev",
      "mergeCommit": {
        "oid": "1c4f87224c9dc3c2850bd64d0e9f478635e659e6"
      },
      "comments": [],
      "reviews": []
    },
    {
      "number": 16,
      "id": "PR_kwDOL5eEDM50kQkB",
      "title": "Add appendix with component algorithm references",
      "url": "https://github.com/lamps-wg/draft-composite-sigs/pull/16",
      "state": "OPEN",
      "author": "janklaussner",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "* appendix with references of signature, curves and hashes\r\n* updated section 'Algorithm Identifiers' with reference to appendix and IDs of component algorithms\r\n* updated algorithm description for signature generation and verification to use Domain separator",
      "createdAt": "2024-07-05T21:00:55Z",
      "updatedAt": "2024-07-05T21:00:56Z",
      "baseRepository": "lamps-wg/draft-composite-sigs",
      "baseRefName": "main",
      "baseRefOid": "e89f78848179101641dbbe3d02447fde62831570",
      "headRepository": "lamps-wg/draft-composite-sigs",
      "headRefName": "7-add-a-new-section-explicitely-list-spki-algids",
      "headRefOid": "bc535a7842aff5cc0d2a3df3a76313d096d77e3b",
      "closedAt": null,
      "mergedAt": null,
      "mergedBy": null,
      "mergeCommit": null,
      "comments": [],
      "reviews": []
    }
  ]
}